#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-ifnJiAxTCcG5DR9M

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
digitalocean_domain.opentracker: Refreshing state... [id=opentracker.app]
digitalocean_ssh_key.m2: Refreshing state... [id=38210829]
digitalocean_ssh_key.tara: Refreshing state... [id=38240725]
digitalocean_droplet.secondary: Refreshing state... [id=332540871]
digitalocean_droplet_snapshot.original-main-snapshot: Refreshing state... [id=126133672]
digitalocean_domain.blackboards: Refreshing state... [id=blackboards.pl]
digitalocean_record.ns2: Refreshing state... [id=126390272]
digitalocean_record.ns3: Refreshing state... [id=126390273]
digitalocean_record.ns1: Refreshing state... [id=126390270]
digitalocean_droplet.postgres: Refreshing state... [id=359941733]
digitalocean_record.opentracker-ns1: Refreshing state... [id=313829950]
digitalocean_record.opentracker-ns3: Refreshing state... [id=313829951]
digitalocean_record.opentracker-ns2: Refreshing state... [id=313829953]
digitalocean_record.opentracker-root: Refreshing state... [id=313829952]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
aws_iam_user.personal: Refreshing state... [id=alex.jackson]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
aws_s3_bucket.remote_state: Refreshing state... [id=terraform-remote-state-m3rc9k]
aws_iam_access_key.personal: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
aws_iam_user_login_profile.personal: Refreshing state... [id=alex.jackson]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_iam_user_policy.personal: Refreshing state... [id=alex.jackson:alex.jackson.policy]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
aws_s3_bucket_versioning.remote_state: Refreshing state... [id=terraform-remote-state-m3rc9k]
digitalocean_droplet.postgres: Drift detected (update)
digitalocean_project.blackboards: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_droplet.postgres must be replaced
-/+ resource "digitalocean_droplet" "postgres" {
      ~ created_at           = "2023-06-10T19:34:01Z" -> (known after apply)
      ~ disk                 = 25 -> (known after apply)
      ~ id                   = "359941733" -> (known after apply)
      ~ ipv4_address         = "159.65.59.250" -> (known after apply)
      ~ ipv4_address_private = "10.131.0.3" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 1024 -> (known after apply)
        name                 = "postgres"
      ~ price_hourly         = 0.00893 -> (known after apply)
      ~ price_monthly        = 6 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ ssh_keys             = [ # forces replacement
          - "38210829",
        ] -> (known after apply) # forces replacement
      ~ status               = "active" -> (known after apply)
      - tags                 = [] -> null
      ~ urn                  = "do:droplet:359941733" -> (known after apply)
      ~ vcpus                = 1 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "a1c4e609-4bda-4513-a0c4-230fbfcfdd3d" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # digitalocean_project.blackboards will be updated in-place
  ~ resource "digitalocean_project" "blackboards" {
        id          = "d006b183-c896-4d41-a341-fb46d729eeb6"
        name        = "blackboards"
      ~ resources   = [
          - "do:droplet:359941733",
            # (3 unchanged elements hidden)
        ]
        # (7 unchanged attributes hidden)
    }

  # digitalocean_ssh_key.secondary will be created
  + resource "digitalocean_ssh_key" "secondary" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "secondary"
      + public_key  = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCZdu+FlEVWYsMOxRj2pVvomQJpuvj/nKA7EdCBYkSV4mEVnAXW1ETKs6ZPe1KUnY3wjSAHYAR/OZX+M0UaDm/sivPUPqIjNysYtxJC5cnCKGX0wj+gG7j8VmSy4xogkbA22YA3g5hAMX4bkGvtmrBuXkaMaTGYuQ/mEMMBp3aFfojyTfUioJt/UBm6N5fkxwJMxblzEiIsTFx2KaFlAa1JxV0/Zs5CX4tMn2BNQHSdvOxcfuU7q8ABfnSSe0CZA2XDBFO1pWrr48sUrf1TP4V7ux9TlSL5h53F9DaNNipeo7SQyv5apu30qjJzG2STLiAmq2i6eu9AtJwwWelhKgbwEXa49bYmXVbsXej0PRPF2jBNsnuzVukNk1G5JF+vYWyRoJLHqZvBA1fmCpbv/A8aL4CLbgYzfwkDqMAZvqKAXKfRHPBqmTfwjLPidKiYSqmfGA2YMP0vRGJ/yOC51g74wpn3P0OUb5R59ZBNaT/pqooGmOcwCpujmR4nl3n8wj0= root@secondary
        EOT
    }

  # digitalocean_ssh_key.tara will be updated in-place
  ~ resource "digitalocean_ssh_key" "tara" {
        id          = "38240725"
      ~ name        = "m2" -> "tara"
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

```

</details>